finalisasi readme dan link vercel
